MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8E1AFDCFB/mcu.h
        struct
        {
            __IOM uint16_t P000DG : 2;  /*!< [1..0] P000 Differential Input Gain SettingNOTE: When these
                                         *   bits are used, set {P000DEN, P000GEN} to 11b.                             */
            uint16_t               : 1;
            __IOM uint16_t P000DEN : 1; /*!< [3..3] P000 Differential Input Enable                                     */
            __IOM uint16_t P001DG  : 2; /*!< [5..4] P001 Differential Input Gain SettingNOTE: When these
                                         *   bits are used, set {P001DEN, P001GEN} to 11b.                             */
            uint16_t               : 1;
            __IOM uint16_t P001DEN : 1; /*!< [7..7] P001 Differential Input Enable                                     */
            __IOM uint16_t P002DG  : 2; /*!< [9..8] P002 Differential Input Gain SettingNOTE: When these
                                         *   bits are used, set {P002DEN, P002GEN} to 11b.                             */
            uint16_t               : 1;
            __IOM uint16_t P002DEN : 1; /*!< [11..11] P002 Differential Input Enable                                   */
            __IOM uint16_t P003DG  : 2; /*!< [13..12] P003 Differential Input Gain SettingNOTE: When these
                                         *   bits are used, set {P003DEN, P003GEN} to 11b.                             */
            uint16_t               : 1;
            __IOM uint16_t P003DEN : 1; /*!< [15..15] P003 Differential Input Enable                                   */
        } ADPGADCR0_b;
    };
    __IM uint16_t RESERVED24;

    union
    {
        __IOM uint8_t ADPGADBS0;       /*!< (@ 0x000001B4) A/D Programmable Gain Amplifier Differential
                                        *                  Input Bias Select Register 0                               */

        struct
        {
            __IOM uint8_t P0BIAS : 1;  /*!< [0..0] Programmable Gain Amplifiers P000 to P002 Bias Voltage
                                        *   SelectNOTE: This bit selects the input bias voltage value
                                        *   when differential inputs are used.                                        */
            uint8_t : 7;
        } ADPGADBS0_b;
    };

    union
    {
        __IOM uint8_t ADPGADBS1;       /*!< (@ 0x000001B5) A/D Programmable Gain Amplifier Differential
                                        *                  Input Bias Select Register 1                               */

        struct
        {
            __IOM uint8_t P3BIAS : 1;  /*!< [0..0] Programmable Gain Amplifiers P003 Bias Voltage SelectNOTE:
                                        *   This bit selects the input bias voltage value when differential
                                        *   inputs are used.                                                          */
            uint8_t : 7;
        } ADPGADBS1_b;
    };
    __IM uint16_t RESERVED25;
    __IM uint32_t RESERVED26[10];

    union
    {
        __IOM uint32_t ADREFMON;       /*!< (@ 0x000001E0) A/D External Reference Voltage Monitor Register            */

        struct
        {
            __IOM uint32_t PGAMON : 3; /*!< [2..0] PGA Monitor Output Enable                                          */
            uint32_t              : 13;
            __IOM uint32_t MONSEL : 4; /*!< [19..16] Monitor output selection bit.                                    */
            uint32_t              : 12;
        } ADREFMON_b;
    };
} R_ADC0_Type;                         /*!< Size = 484 (0x1e4)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_PSCU                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Peripheral Security Control Unit (R_PSCU)
 */

typedef struct                         /*!< (@ 0x40204000) R_PSCU Structure                                           */
{
    __IM uint32_t RESERVED;

    union
    {
        __IOM uint32_t PSARB;           /*!< (@ 0x00000004) Peripheral Security Attribution Register B                 */

        struct
        {
            __IOM uint32_t PSARB0  : 1; /*!< [0..0] Peripheral security attribution bit 0                              */
            __IOM uint32_t PSARB1  : 1; /*!< [1..1] Peripheral security attribution bit 1                              */
            __IOM uint32_t PSARB2  : 1; /*!< [2..2] Peripheral security attribution bit 2                              */
            __IOM uint32_t PSARB3  : 1; /*!< [3..3] Peripheral security attribution bit 3                              */
            __IOM uint32_t PSARB4  : 1; /*!< [4..4] Peripheral security attribution bit 4                              */
            __IOM uint32_t PSARB5  : 1; /*!< [5..5] Peripheral security attribution bit 5                              */
            __IOM uint32_t PSARB6  : 1; /*!< [6..6] Peripheral security attribution bit 6                              */
            __IOM uint32_t PSARB7  : 1; /*!< [7..7] Peripheral security attribution bit 7                              */
            __IOM uint32_t PSARB8  : 1; /*!< [8..8] Peripheral security attribution bit 8                              */
            __IOM uint32_t PSARB9  : 1; /*!< [9..9] Peripheral security attribution bit 9                              */
            __IOM uint32_t PSARB10 : 1; /*!< [10..10] Peripheral security attribution bit 10                           */
            __IOM uint32_t PSARB11 : 1; /*!< [11..11] Peripheral security attribution bit 11                           */
            __IOM uint32_t PSARB12 : 1; /*!< [12..12] Peripheral security attribution bit 12                           */
            __IOM uint32_t PSARB13 : 1; /*!< [13..13] Peripheral security attribution bit 13                           */
            __IOM uint32_t PSARB14 : 1; /*!< [14..14] Peripheral security attribution bit 14                           */
            __IOM uint32_t PSARB15 : 1; /*!< [15..15] Peripheral security attribution bit 15                           */
            __IOM uint32_t PSARB16 : 1; /*!< [16..16] Peripheral security attribution bit 16                           */
            __IOM uint32_t PSARB17 : 1; /*!< [17..17] Peripheral security attribution bit 17                           */
            __IOM uint32_t PSARB18 : 1; /*!< [18..18] Peripheral security attribution bit 18                           */
            __IOM uint32_t PSARB19 : 1; /*!< [19..19] Peripheral security attribution bit 19                           */
            __IOM uint32_t PSARB20 : 1; /*!< [20..20] Peripheral security attribution bit 20                           */
            __IOM uint32_t PSARB21 : 1; /*!< [21..21] Peripheral security attribution bit 21                           */
            __IOM uint32_t PSARB22 : 1; /*!< [22..22] Peripheral security attribution bit 22                           */
            __IOM uint32_t PSARB23 : 1; /*!< [23..23] Peripheral security attribution bit 23                           */
            __IOM uint32_t PSARB24 : 1; /*!< [24..24] Peripheral security attribution bit 24                           */
            __IOM uint32_t PSARB25 : 1; /*!< [25..25] Peripheral security attribution bit 25                           */
            __IOM uint32_t PSARB26 : 1; /*!< [26..26] Peripheral security attribution bit 26                           */
            __IOM uint32_t PSARB27 : 1; /*!< [27..27] Peripheral security attribution bit 27                           */
            __IOM uint32_t PSARB28 : 1; /*!< [28..28] Peripheral security attribution bit 28                           */
            __IOM uint32_t PSARB29 : 1; /*!< [29..29] Peripheral security attribution bit 29                           */
            __IOM uint32_t PSARB30 : 1; /*!< [30..30] Peripheral security attribution bit 30                           */
            __IOM uint32_t PSARB31 : 1; /*!< [31..31] Peripheral security attribution bit 31                           */
        } PSARB_b;
    };

    union
    {
        __IOM uint32_t PSARC;           /*!< (@ 0x00000008) Peripheral Security Attribution Register C                 */

        struct
        {
            __IOM uint32_t PSARC0  : 1; /*!< [0..0] Peripheral security attribution bit 0                              */
            __IOM uint32_t PSARC1  : 1; /*!< [1..1] Peripheral security attribution bit 1                              */
            __IOM uint32_t PSARC2  : 1; /*!< [2..2] Peripheral security attribution bit 2                              */
            __IOM uint32_t PSARC3  : 1; /*!< [3..3] Peripheral security attribution bit 3                              */
            __IOM uint32_t PSARC4  : 1; /*!< [4..4] Peripheral security attribution bit 4                              */
            __IOM uint32_t PSARC5  : 1; /*!< [5..5] Peripheral security attribution bit 5                              */
            __IOM uint32_t PSARC6  : 1; /*!< [6..6] Peripheral security attribution bit 6                              */
            __IOM uint32_t PSARC7  : 1; /*!< [7..7] Peripheral security attribution bit 7                              */
            __IOM uint32_t PSARC8  : 1; /*!< [8..8] Peripheral security attribution bit 8                              */
            __IOM uint32_t PSARC9  : 1; /*!< [9..9] Peripheral security attribution bit 9                              */
            __IOM uint32_t PSARC10 : 1; /*!< [10..10] Peripheral security attribution bit 10                           */
            __IOM uint32_t PSARC11 : 1; /*!< [11..11] Peripheral security attribution bit 11                           */
            __IOM uint32_t PSARC12 : 1; /*!< [12..12] Peripheral security attribution bit 12                           */
            __IOM uint32_t PSARC13 : 1; /*!< [13..13] Peripheral security attribution bit 13                           */
            __IOM uint32_t PSARC14 : 1; /*!< [14..14] Peripheral security attribution bit 14                           */
            __IOM uint32_t PSARC15 : 1; /*!< [15..15] Peripheral security attribution bit 15                           */
            __IOM uint32_t PSARC16 : 1; /*!< [16..16] Peripheral security attribution bit 16                           */
            __IOM uint32_t PSARC17 : 1; /*!< [17..17] Peripheral security attribution bit 17                           */
            __IOM uint32_t PSARC18 : 1; /*!< [18..18] Peripheral security attribution bit 18                           */
            __IOM uint32_t PSARC19 : 1; /*!< [19..19] Peripheral security attribution bit 19                           */
            __IOM uint32_t PSARC20 : 1; /*!< [20..20] Peripheral security attribution bit 20                           */
            __IOM uint32_t PSARC21 : 1; /*!< [21..21] Peripheral security attribution bit 21                           */
            __IOM uint32_t PSARC22 : 1; /*!< [22..22] Peripheral security attribution bit 22                           */
            __IOM uint32_t PSARC23 : 1; /*!< [23..23] Peripheral security attribution bit 23                           */
            __IOM uint32_t PSARC24 : 1; /*!< [24..24] Peripheral security attribution bit 24                           */
            __IOM uint32_t PSARC25 : 1; /*!< [25..25] Peripheral security attribution bit 25                           */
            __IOM uint32_t PSARC26 : 1; /*!< [26..26] Peripheral security attribution bit 26                           */
            __IOM uint32_t PSARC27 : 1; /*!< [27..27] Peripheral security attribution bit 27                           */
            __IOM uint32_t PSARC28 : 1; /*!< [28..28] Peripheral security attribution bit 28                           */
            __IOM uint32_t PSARC29 : 1; /*!< [29..29] Peripheral security attribution bit 29                           */
            __IOM uint32_t PSARC30 : 1; /*!< [30..30] Peripheral security attribution bit 30                           */
            __IOM uint32_t PSARC31 : 1; /*!< [31..31] Peripheral security attribution bit 31                           */
        } PSARC_b;
    };

    union
    {
        __IOM uint32_t PSARD;           /*!< (@ 0x0000000C) Peripheral Security Attribution Register D                 */

        struct
        {
            __IOM uint32_t PSARD0  : 1; /*!< [0..0] Peripheral security attribution bit 0                              */
            __IOM uint32_t PSARD1  : 1; /*!< [1..1] Peripheral security attribution bit 1                              */
            __IOM uint32_t PSARD2  : 1; /*!< [2..2] Peripheral security attribution bit 2                              */
            __IOM uint32_t PSARD3  : 1; /*!< [3..3] Peripheral security attribution bit 3                              */
            __IOM uint32_t PSARD4  : 1; /*!< [4..4] Peripheral security attribution bit 4                              */
            __IOM uint32_t PSARD5  : 1; /*!< [5..5] Peripheral security attribution bit 5                              */
            __IOM uint32_t PSARD6  : 1; /*!< [6..6] Peripheral security attribution bit 6                              */
            __IOM uint32_t PSARD7  : 1; /*!< [7..7] Peripheral security attribution bit 7                              */
            __IOM uint32_t PSARD8  : 1; /*!< [8..8] Peripheral security attribution bit 8                              */
            __IOM uint32_t PSARD9  : 1; /*!< [9..9] Peripheral security attribution bit 9                              */
            __IOM uint32_t PSARD10 : 1; /*!< [10..10] Peripheral security attribution bit 10                           */
            __IOM uint32_t PSARD11 : 1; /*!< [11..11] Peripheral security attribution bit 11                           */
            __IOM uint32_t PSARD12 : 1; /*!< [12..12] Peripheral security attribution bit 12                           */
            __IOM uint32_t PSARD13 : 1; /*!< [13..13] Peripheral security attribution bit 13                           */
            __IOM uint32_t PSARD14 : 1; /*!< [14..14] Peripheral security attribution bit 14                           */
            __IOM uint32_t PSARD15 : 1; /*!< [15..15] Peripheral security attribution bit 15                           */
            __IOM uint32_t PSARD16 : 1; /*!< [16..16] Peripheral security attribution bit 16                           */
            __IOM uint32_t PSARD17 : 1; /*!< [17..17] Peripheral security attribution bit 17                           */
            __IOM uint32_t PSARD18 : 1; /*!< [18..18] Peripheral security attribution bit 18                           */
            __IOM uint32_t PSARD19 : 1; /*!< [19..19] Peripheral security attribution bit 19                           */
            __IOM uint32_t PSARD20 : 1; /*!< [20..20] Peripheral security attribution bit 20                           */
            __IOM uint32_t PSARD21 : 1; /*!< [21..21] Peripheral security attribution bit 21                           */
            __IOM uint32_t PSARD22 : 1; /*!< [22..22] Peripheral security attribution bit 22                           */
            __IOM uint32_t PSARD23 : 1; /*!< [23..23] Peripheral security attribution bit 23                           */
            __IOM uint32_t PSARD24 : 1; /*!< [24..24] Peripheral security attribution bit 24                           */
            __IOM uint32_t PSARD25 : 1; /*!< [25..25] Peripheral security attribution bit 25                           */
            __IOM uint32_t PSARD26 : 1; /*!< [26..26] Peripheral security attribution bit 26                           */
            __IOM uint32_t PSARD27 : 1; /*!< [27..27] Peripheral security attribution bit 27                           */
            __IOM uint32_t PSARD28 : 1; /*!< [28..28] Peripheral security attribution bit 28                           */
            __IOM uint32_t PSARD29 : 1; /*!< [29..29] Peripheral security attribution bit 29                           */
            __IOM uint32_t PSARD30 : 1; /*!< [30..30] Peripheral security attribution bit 30                           */
            __IOM uint32_t PSARD31 : 1; /*!< [31..31] Peripheral security attribution bit 31                           */
        } PSARD_b;
    };

    union
    {
        __IOM uint32_t PSARE;           /*!< (@ 0x00000010) Peripheral Security Attribution Register E                 */

        struct
        {
            __IOM uint32_t PSARE0  : 1; /*!< [0..0] Peripheral security attribution bit 0                              */
            __IOM uint32_t PSARE1  : 1; /*!< [1..1] Peripheral security attribution bit 1                              */
            __IOM uint32_t PSARE2  : 1; /*!< [2..2] Peripheral security attribution bit 2                              */
            __IOM uint32_t PSARE3  : 1; /*!< [3..3] Peripheral security attribution bit 3                              */
            __IOM uint32_t PSARE4  : 1; /*!< [4..4] Peripheral security attribution bit 4                              */
            __IOM uint32_t PSARE5  : 1; /*!< [5..5] Peripheral security attribution bit 5                              */
            __IOM uint32_t PSARE6  : 1; /*!< [6..6] Peripheral security attribution bit 6                              */
            __IOM uint32_t PSARE7  : 1; /*!< [7..7] Peripheral security attribution bit 7                              */
            __IOM uint32_t PSARE8  : 1; /*!< [8..8] Peripheral security attribution bit 8                              */
            __IOM uint32_t PSARE9  : 1; /*!< [9..9] Peripheral security attribution bit 9                              */
            __IOM uint32_t PSARE10 : 1; /*!< [10..10] Peripheral security attribution bit 10                           */
            __IOM uint32_t PSARE11 : 1; /*!< [11..11] Peripheral security attribution bit 11                           */
            __IOM uint32_t PSARE12 : 1; /*!< [12..12] Peripheral security attribution bit 12                           */
            __IOM uint32_t PSARE13 : 1; /*!< [13..13] Peripheral security attribution bit 13                           */
            __IOM uint32_t PSARE14 : 1; /*!< [14..14] Peripheral security attribution bit 14                           */
            __IOM uint32_t PSARE15 : 1; /*!< [15..15] Peripheral security attribution bit 15                           */
            __IOM uint32_t PSARE16 : 1; /*!< [16..16] Peripheral security attribution bit 16                           */
            __IOM uint32_t PSARE17 : 1; /*!< [17..17] Peripheral security attribution bit 17                           */
            __IOM uint32_t PSARE18 : 1; /*!< [18..18] Peripheral security attribution bit 18                           */
            __IOM uint32_t PSARE19 : 1; /*!< [19..19] Peripheral security attribution bit 19                           */
            __IOM uint32_t PSARE20 : 1; /*!< [20..20] Peripheral security attribution bit 20                           */
            __IOM uint32_t PSARE21 : 1; /*!< [21..21] Peripheral security attribution bit 21                           */
            __IOM uint32_t PSARE22 : 1; /*!< [22..22] Peripheral security attribution bit 22                           */
            __IOM uint32_t PSARE23 : 1; /*!< [23..23] Peripheral security attribution bit 23                           */
            __IOM uint32_t PSARE24 : 1; /*!< [24..24] Peripheral security attribution bit 24                           */
            __IOM uint32_t PSARE25 : 1; /*!< [25..25] Peripheral security attribution bit 25                           */
            __IOM uint32_t PSARE26 : 1; /*!< [26..26] Peripheral security attribution bit 26                           */
            __IOM uint32_t PSARE27 : 1; /*!< [27..27] Peripheral security attribution bit 27                           */
            __IOM uint32_t PSARE28 : 1; /*!< [28..28] Peripheral security attribution bit 28                           */
            __IOM uint32_t PSARE29 : 1; /*!< [29..29] Peripheral security attribution bit 29                           */
            __IOM uint32_t PSARE30 : 1; /*!< [30..30] Peripheral security attribution bit 30                           */
            __IOM uint32_t PSARE31 : 1; /*!< [31..31] Peripheral security attribution bit 31                           */
        } PSARE_b;
    };

    union
    {
        __IOM uint32_t MSSAR;           /*!< (@ 0x00000014) Module Stop Security Attribution Register                  */

