MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8E1AFDCFB/mcu.h
        struct
        {
            __IOM uint32_t IRQWUPEN0 : 1;   /*!< [0..0] IRQ0 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN1 : 1;   /*!< [1..1] IRQ1 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN2 : 1;   /*!< [2..2] IRQ2 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN3 : 1;   /*!< [3..3] IRQ3 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN4 : 1;   /*!< [4..4] IRQ4 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN5 : 1;   /*!< [5..5] IRQ5 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN6 : 1;   /*!< [6..6] IRQ6 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN7 : 1;   /*!< [7..7] IRQ7 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN8 : 1;   /*!< [8..8] IRQ8 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN9 : 1;   /*!< [9..9] IRQ9 Interrupt Deep Sleep/Software Standby Returns Enable
                                             *   bit                                                                       */
            __IOM uint32_t IRQWUPEN10 : 1;  /*!< [10..10] IRQ10 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN11 : 1;  /*!< [11..11] IRQ11 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN12 : 1;  /*!< [12..12] IRQ12 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN13 : 1;  /*!< [13..13] IRQ13 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN14 : 1;  /*!< [14..14] IRQ14 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IRQWUPEN15 : 1;  /*!< [15..15] IRQ15 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t IWDTWUPEN : 1;   /*!< [16..16] IWDT Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            uint32_t                 : 1;
            __IOM uint32_t LVD1WUPEN : 1;   /*!< [18..18] PVD1 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t LVD2WUPEN : 1;   /*!< [19..19] PVD2 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t VBATTWUPEN : 1;  /*!< [20..20] VBATT Monitor Interrupt Deep Sleep/Software Standby
                                             *   Returns Enable bit                                                        */
            uint32_t                   : 3;
            __IOM uint32_t RTCALMWUPEN : 1; /*!< [24..24] RTC Alarm Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t RTCPRDWUPEN : 1; /*!< [25..25] RCT Period Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t USBHSWUPEN : 1;  /*!< [26..26] USBHS Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t USBFSWUPEN : 1;  /*!< [27..27] USBFS0 Interrupt Deep Sleep/Software Standby Returns
                                             *   Enable bit                                                                */
            __IOM uint32_t AGT1UDWUPEN : 1; /*!< [28..28] AGT1 Underflow Interrupt Deep Sleep/Software Standby
                                             *   Returns Enable bit                                                        */
            __IOM uint32_t AGT1CAWUPEN : 1; /*!< [29..29] AGT1 Compare Match A Interrupt Deep Sleep/Software
                                             *   Standby Returns Enable bit                                                */
            __IOM uint32_t AGT1CBWUPEN : 1; /*!< [30..30] AGT1 Compare Match B Interrupt Deep Sleep/Software
                                             *   Standby Returns Enable bit                                                */
            __IOM uint32_t RIIC0WUPEN : 1;  /*!< [31..31] RIIC0 Address Match Interrupt Deep Sleep/Software Standby
                                             *   Returns Enable bit                                                        */
        } WUPEN_b;
    };

    union
    {
        __IOM uint32_t WUPEN1;         /*!< (@ 0x000061A4) Wake Up Interrupt Enable Register 1                        */

        struct
        {
            uint32_t                    : 3;
            __IOM uint32_t COMPHS0WUPEN : 1; /*!< [3..3] Comparator-HS0 Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            uint32_t                  : 4;
            __IOM uint32_t ULP0UWUPEN : 1;   /*!< [8..8] ULPT0 Underflow Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            __IOM uint32_t ULP0AWUPEN : 1;   /*!< [9..9] ULPT0 Compare Match A Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            __IOM uint32_t ULP0BWUPEN : 1;   /*!< [10..10] ULPT0 Compare Match B Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            __IOM uint32_t I3CWUPEN : 1;     /*!< [11..11] I3C Wakeup Condition Detection Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            __IOM uint32_t ULP1UWUPEN : 1;   /*!< [12..12] ULPT1 Underflow Interrupt Deep Sleep/Software Standby
                                              *   Returns Enable bit                                                        */
            __IOM uint32_t ULP1AWUPEN : 1;   /*!< [13..13] ULPT1 Compare Match A Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            __IOM uint32_t ULP1BWUPEN : 1;   /*!< [14..14] ULPT1 Compare Match B Interrupt Deep Sleep/Software
                                              *   Standby Returns Enable bit                                                */
            uint32_t : 17;
        } WUPEN1_b;
    };
    __IM uint32_t RESERVED17[86];

    union
    {
        __IOM uint32_t IELSR[96];      /*!< (@ 0x00006300) ICU Event Link Setting Register [0..95]                    */

        struct
        {
            __IOM uint32_t IELS : 9;   /*!< [8..0] ICU Event selection to NVICSet the number for the event
                                        *   signal to be linked .                                                     */
            uint32_t            : 7;
            __IOM uint32_t IR   : 1;   /*!< [16..16] Interrupt Status Flag                                            */
            uint32_t            : 7;
            __IOM uint32_t DTCE : 1;   /*!< [24..24] DTC Activation Enable                                            */
            uint32_t            : 7;
        } IELSR_b[96];
    };
} R_ICU_Type;                          /*!< Size = 25728 (0x6480)                                                     */

/* =========================================================================================================================== */
/* ================                                          R_IIC0                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief I2C Bus Interface (R_IIC0)
 */

typedef struct                         /*!< (@ 0x4025E000) R_IIC0 Structure                                           */
{
    union
    {
        __IOM uint8_t ICCR1;           /*!< (@ 0x00000000) I2C Bus Control Register 1                                 */

        struct
        {
            __IM uint8_t  SDAI   : 1;  /*!< [0..0] SDA Line Monitor                                                   */
            __IM uint8_t  SCLI   : 1;  /*!< [1..1] SCL Line Monitor                                                   */
            __IOM uint8_t SDAO   : 1;  /*!< [2..2] SDA Output Control/Monitor                                         */
            __IOM uint8_t SCLO   : 1;  /*!< [3..3] SCL Output Control/Monitor                                         */
            __IOM uint8_t SOWP   : 1;  /*!< [4..4] SCLO/SDAO Write Protect                                            */
            __IOM uint8_t CLO    : 1;  /*!< [5..5] Extra SCL Clock Cycle Output                                       */
            __IOM uint8_t IICRST : 1;  /*!< [6..6] I2C Bus Interface Internal ResetNote:If an internal reset
                                        *   is initiated using the IICRST bit for a bus hang-up occurred
                                        *   during communication with the master device in slave mode,
                                        *   the states may become different between the slave device
                                        *   and the master device (due to the difference in the bit
                                        *   counter information).                                                     */
            __IOM uint8_t ICE : 1;     /*!< [7..7] I2C Bus Interface Enable                                           */
        } ICCR1_b;
    };

    union
    {
        __IOM uint8_t ICCR2;           /*!< (@ 0x00000001) I2C Bus Control Register 2                                 */

        struct
        {
            uint8_t          : 1;
            __IOM uint8_t ST : 1;      /*!< [1..1] Start Condition Issuance RequestSet the ST bit to 1 (start
                                        *   condition issuance request) when the BBSY flag is set to
                                        *   0 (bus free state).                                                       */
            __IOM uint8_t RS : 1;      /*!< [2..2] Restart Condition Issuance RequestNote: Do not set the
                                        *   RS bit to 1 while issuing a stop condition.                               */
            __IOM uint8_t SP : 1;      /*!< [3..3] Stop Condition Issuance RequestNote: Writing to the SP
                                        *   bit is not possible while the setting of the BBSY flag
                                        *   is 0 (bus free state).Note: Do not set the SP bit to 1
                                        *   while a restart condition is being issued.                                */
            uint8_t            : 1;
            __IOM uint8_t TRS  : 1;    /*!< [5..5] Transmit/Receive Mode                                              */
            __IOM uint8_t MST  : 1;    /*!< [6..6] Master/Slave Mode                                                  */
            __IM uint8_t  BBSY : 1;    /*!< [7..7] Bus Busy Detection Flag                                            */
        } ICCR2_b;
    };

    union
    {
        __IOM uint8_t ICMR1;           /*!< (@ 0x00000002) I2C Bus Mode Register 1                                    */

        struct
        {
            __IOM uint8_t BC   : 3;    /*!< [2..0] Bit Counter                                                        */
            __OM uint8_t  BCWP : 1;    /*!< [3..3] BC Write Protect(This bit is read as 1.)                           */
            __IOM uint8_t CKS  : 3;    /*!< [6..4] Internal Reference Clock (fIIC) Selection ( fIIC = PCLKB
                                        *   / 2^CKS )                                                                 */
            __IOM uint8_t MTWP : 1;    /*!< [7..7] MST/TRS Write Protect                                              */
        } ICMR1_b;
    };

    union
    {
        __IOM uint8_t ICMR2;           /*!< (@ 0x00000003) I2C Bus Mode Register 2                                    */

        struct
        {
            __IOM uint8_t TMOS : 1;    /*!< [0..0] Timeout Detection Time Select                                      */
            __IOM uint8_t TMOL : 1;    /*!< [1..1] Timeout L Count Control                                            */
            __IOM uint8_t TMOH : 1;    /*!< [2..2] Timeout H Count Control                                            */
            uint8_t            : 1;
            __IOM uint8_t SDDL : 3;    /*!< [6..4] SDA Output Delay Counter                                           */
            __IOM uint8_t DLCS : 1;    /*!< [7..7] SDA Output Delay Clock Source Select                               */
        } ICMR2_b;
    };

    union
    {
        __IOM uint8_t ICMR3;           /*!< (@ 0x00000004) I2C Bus Mode Register 3                                    */

        struct
        {
            __IOM uint8_t NF    : 2;   /*!< [1..0] Noise Filter Stage Selection                                       */
            __IM uint8_t  ACKBR : 1;   /*!< [2..2] Receive Acknowledge                                                */
            __IOM uint8_t ACKBT : 1;   /*!< [3..3] Transmit Acknowledge                                               */
            __IOM uint8_t ACKWP : 1;   /*!< [4..4] ACKBT Write Protect                                                */
            __IOM uint8_t RDRFS : 1;   /*!< [5..5] RDRF Flag Set Timing Selection                                     */
            __IOM uint8_t WAIT  : 1;   /*!< [6..6] WAITNote: When the value of the WAIT bit is to be read,
                                        *   be sure to read the ICDRR beforehand.                                     */
            __IOM uint8_t SMBS : 1;    /*!< [7..7] SMBus/I2C Bus Selection                                            */
        } ICMR3_b;
    };

    union
    {
        __IOM uint8_t ICFER;           /*!< (@ 0x00000005) I2C Bus Function Enable Register                           */

        struct
        {
            __IOM uint8_t TMOE  : 1;   /*!< [0..0] Timeout Function Enable                                            */
            __IOM uint8_t MALE  : 1;   /*!< [1..1] Master Arbitration-Lost Detection Enable                           */
            __IOM uint8_t NALE  : 1;   /*!< [2..2] NACK Transmission Arbitration-Lost Detection Enable                */
            __IOM uint8_t SALE  : 1;   /*!< [3..3] Slave Arbitration-Lost Detection Enable                            */
            __IOM uint8_t NACKE : 1;   /*!< [4..4] NACK Reception Transfer Suspension Enable                          */
            __IOM uint8_t NFE   : 1;   /*!< [5..5] Digital Noise Filter Circuit Enable                                */
            __IOM uint8_t SCLE  : 1;   /*!< [6..6] SCL Synchronous Circuit Enable                                     */
            __IOM uint8_t FMPE  : 1;   /*!< [7..7] Fast-mode Plus Enable                                              */
        } ICFER_b;
    };

    union
    {
        __IOM uint8_t ICSER;           /*!< (@ 0x00000006) I2C Bus Status Enable Register                             */

        struct
        {
            __IOM uint8_t SAR0E : 1;   /*!< [0..0] Slave Address Register 0 Enable                                    */
            __IOM uint8_t SAR1E : 1;   /*!< [1..1] Slave Address Register 1 Enable                                    */
            __IOM uint8_t SAR2E : 1;   /*!< [2..2] Slave Address Register 2 Enable                                    */
            __IOM uint8_t GCAE  : 1;   /*!< [3..3] General Call Address Enable                                        */
            uint8_t             : 1;
            __IOM uint8_t DIDE  : 1;   /*!< [5..5] Device-ID Address Detection Enable                                 */
            uint8_t             : 1;
            __IOM uint8_t HOAE  : 1;   /*!< [7..7] Host Address Enable                                                */
        } ICSER_b;
    };

    union
    {
        __IOM uint8_t ICIER;           /*!< (@ 0x00000007) I2C Bus Interrupt Enable Register                          */

        struct
        {
            __IOM uint8_t TMOIE : 1;   /*!< [0..0] Timeout Interrupt Request Enable                                   */
            __IOM uint8_t ALIE  : 1;   /*!< [1..1] Arbitration-Lost Interrupt Request Enable                          */
            __IOM uint8_t STIE  : 1;   /*!< [2..2] Start Condition Detection Interrupt Request Enable                 */
            __IOM uint8_t SPIE  : 1;   /*!< [3..3] Stop Condition Detection Interrupt Request Enable                  */
            __IOM uint8_t NAKIE : 1;   /*!< [4..4] NACK Reception Interrupt Request Enable                            */
            __IOM uint8_t RIE   : 1;   /*!< [5..5] Receive Data Full Interrupt Request Enable                         */
            __IOM uint8_t TEIE  : 1;   /*!< [6..6] Transmit End Interrupt Request Enable                              */
            __IOM uint8_t TIE   : 1;   /*!< [7..7] Transmit Data Empty Interrupt Request Enable                       */
        } ICIER_b;
    };

    union
    {
        __IOM uint8_t ICSR1;           /*!< (@ 0x00000008) I2C Bus Status Register 1                                  */

        struct
        {
            __IOM uint8_t AAS0 : 1;    /*!< [0..0] Slave Address 0 Detection Flag                                     */
            __IOM uint8_t AAS1 : 1;    /*!< [1..1] Slave Address 1 Detection Flag                                     */
            __IOM uint8_t AAS2 : 1;    /*!< [2..2] Slave Address 2 Detection Flag                                     */
            __IOM uint8_t GCA  : 1;    /*!< [3..3] General Call Address Detection Flag                                */
            uint8_t            : 1;
            __IOM uint8_t DID  : 1;    /*!< [5..5] Device-ID Address Detection Flag                                   */
            uint8_t            : 1;
            __IOM uint8_t HOA  : 1;    /*!< [7..7] Host Address Detection Flag                                        */
        } ICSR1_b;
    };

    union
    {
        __IOM uint8_t ICSR2;           /*!< (@ 0x00000009) I2C Bus Status Register 2                                  */

        struct
        {
            __IOM uint8_t TMOF  : 1;   /*!< [0..0] Timeout Detection Flag                                             */
            __IOM uint8_t AL    : 1;   /*!< [1..1] Arbitration-Lost Flag                                              */
            __IOM uint8_t START : 1;   /*!< [2..2] Start Condition Detection Flag                                     */
            __IOM uint8_t STOP  : 1;   /*!< [3..3] Stop Condition Detection Flag                                      */
            __IOM uint8_t NACKF : 1;   /*!< [4..4] NACK Detection Flag                                                */
            __IOM uint8_t RDRF  : 1;   /*!< [5..5] Receive Data Full Flag                                             */
            __IOM uint8_t TEND  : 1;   /*!< [6..6] Transmit End Flag                                                  */
            __IM uint8_t  TDRE  : 1;   /*!< [7..7] Transmit Data Empty Flag                                           */
        } ICSR2_b;
    };
    __IOM R_IIC0_SAR_Type SAR[3];      /*!< (@ 0x0000000A) Slave Address Registers                                    */

    union
    {
        __IOM uint8_t ICBRL;           /*!< (@ 0x00000010) I2C Bus Bit Rate Low-Level Register                        */

        struct
        {
            __IOM uint8_t BRL : 5;     /*!< [4..0] Bit Rate Low-Level Period(Low-level period of SCL clock)           */
            uint8_t           : 3;
        } ICBRL_b;
    };

    union
    {
        __IOM uint8_t ICBRH;           /*!< (@ 0x00000011) I2C Bus Bit Rate High-Level Register                       */

        struct
        {
            __IOM uint8_t BRH : 5;     /*!< [4..0] Bit Rate High-Level Period(High-level period of SCL clock)         */
            uint8_t           : 3;
        } ICBRH_b;
    };

    union
    {
        __IOM uint8_t ICDRT;           /*!< (@ 0x00000012) I2C Bus Transmit Data Register                             */

        struct
        {
            __IOM uint8_t ICDRT : 8;   /*!< [7..0] 8-bit read-write register that stores transmit data.               */
        } ICDRT_b;
    };

    union
    {
        __IM uint8_t ICDRR;            /*!< (@ 0x00000013) I2C Bus Receive Data Register                              */

        struct
        {
            __IM uint8_t ICDRR : 8;    /*!< [7..0] 8-bit register that stores the received data                       */
        } ICDRR_b;
    };
    __IM uint8_t RESERVED[2];

    union
    {
        __IOM uint8_t ICWUR;           /*!< (@ 0x00000016) I2C Bus Wake Up Unit Register                              */

