MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8E1AFDCFB/mcu.h
/* =======================================================  EC710CTL  ======================================================== */
 #define R_ECCMB0_EC710CTL_ECEMF_Pos      (0UL)          /*!< ECEMF (Bit 0)                                         */
 #define R_ECCMB0_EC710CTL_ECEMF_Msk      (0x1UL)        /*!< ECEMF (Bitfield-Mask: 0x01)                           */
 #define R_ECCMB0_EC710CTL_ECER1F_Pos     (1UL)          /*!< ECER1F (Bit 1)                                        */
 #define R_ECCMB0_EC710CTL_ECER1F_Msk     (0x2UL)        /*!< ECER1F (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECER2F_Pos     (2UL)          /*!< ECER2F (Bit 2)                                        */
 #define R_ECCMB0_EC710CTL_ECER2F_Msk     (0x4UL)        /*!< ECER2F (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_EC1EDIC_Pos    (3UL)          /*!< EC1EDIC (Bit 3)                                       */
 #define R_ECCMB0_EC710CTL_EC1EDIC_Msk    (0x8UL)        /*!< EC1EDIC (Bitfield-Mask: 0x01)                         */
 #define R_ECCMB0_EC710CTL_EC2EDIC_Pos    (4UL)          /*!< EC2EDIC (Bit 4)                                       */
 #define R_ECCMB0_EC710CTL_EC2EDIC_Msk    (0x10UL)       /*!< EC2EDIC (Bitfield-Mask: 0x01)                         */
 #define R_ECCMB0_EC710CTL_EC1ECP_Pos     (5UL)          /*!< EC1ECP (Bit 5)                                        */
 #define R_ECCMB0_EC710CTL_EC1ECP_Msk     (0x20UL)       /*!< EC1ECP (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECERVF_Pos     (6UL)          /*!< ECERVF (Bit 6)                                        */
 #define R_ECCMB0_EC710CTL_ECERVF_Msk     (0x40UL)       /*!< ECERVF (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECER1C_Pos     (9UL)          /*!< ECER1C (Bit 9)                                        */
 #define R_ECCMB0_EC710CTL_ECER1C_Msk     (0x200UL)      /*!< ECER1C (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECER2C_Pos     (10UL)         /*!< ECER2C (Bit 10)                                       */
 #define R_ECCMB0_EC710CTL_ECER2C_Msk     (0x400UL)      /*!< ECER2C (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_ECOVFF_Pos     (11UL)         /*!< ECOVFF (Bit 11)                                       */
 #define R_ECCMB0_EC710CTL_ECOVFF_Msk     (0x800UL)      /*!< ECOVFF (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710CTL_EMCA_Pos       (14UL)         /*!< EMCA (Bit 14)                                         */
 #define R_ECCMB0_EC710CTL_EMCA_Msk       (0xc000UL)     /*!< EMCA (Bitfield-Mask: 0x03)                            */
 #define R_ECCMB0_EC710CTL_ECSEDF0_Pos    (16UL)         /*!< ECSEDF0 (Bit 16)                                      */
 #define R_ECCMB0_EC710CTL_ECSEDF0_Msk    (0x10000UL)    /*!< ECSEDF0 (Bitfield-Mask: 0x01)                         */
 #define R_ECCMB0_EC710CTL_ECDEDF0_Pos    (17UL)         /*!< ECDEDF0 (Bit 17)                                      */
 #define R_ECCMB0_EC710CTL_ECDEDF0_Msk    (0x20000UL)    /*!< ECDEDF0 (Bitfield-Mask: 0x01)                         */
/* =======================================================  EC710TMC  ======================================================== */
 #define R_ECCMB0_EC710TMC_ECDCS_Pos      (1UL)          /*!< ECDCS (Bit 1)                                         */
 #define R_ECCMB0_EC710TMC_ECDCS_Msk      (0x2UL)        /*!< ECDCS (Bitfield-Mask: 0x01)                           */
 #define R_ECCMB0_EC710TMC_ECTMCE_Pos     (7UL)          /*!< ECTMCE (Bit 7)                                        */
 #define R_ECCMB0_EC710TMC_ECTMCE_Msk     (0x80UL)       /*!< ECTMCE (Bitfield-Mask: 0x01)                          */
 #define R_ECCMB0_EC710TMC_ETMA_Pos       (14UL)         /*!< ETMA (Bit 14)                                         */
 #define R_ECCMB0_EC710TMC_ETMA_Msk       (0xc000UL)     /*!< ETMA (Bitfield-Mask: 0x03)                            */
/* =======================================================  EC710TED  ======================================================== */
 #define R_ECCMB0_EC710TED_ECEDB_Pos      (0UL)          /*!< ECEDB (Bit 0)                                         */
 #define R_ECCMB0_EC710TED_ECEDB_Msk      (0xffffffffUL) /*!< ECEDB (Bitfield-Mask: 0xffffffff)                     */
/* =======================================================  EC710EAD0  ======================================================= */
 #define R_ECCMB0_EC710EAD0_ECEAD_Pos     (0UL)          /*!< ECEAD (Bit 0)                                         */
 #define R_ECCMB0_EC710EAD0_ECEAD_Msk     (0x3ffUL)      /*!< ECEAD (Bitfield-Mask: 0x3ff)                          */

/* =========================================================================================================================== */
/* ================                                          R_FLAD                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  FCKMHZ  ========================================================= */
 #define R_FLAD_FCKMHZ_FCKMHZ_Pos    (0UL)    /*!< FCKMHZ (Bit 0)                                        */
 #define R_FLAD_FCKMHZ_FCKMHZ_Msk    (0xffUL) /*!< FCKMHZ (Bitfield-Mask: 0xff)                          */

/* =========================================================================================================================== */
/* ================                                      R_OFS_DATAFLASH                                      ================ */
/* =========================================================================================================================== */

/* =======================================================  FSBLCTRL0  ======================================================= */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLEN_Pos        (0UL)     /*!< FSBLEN (Bit 0)                                        */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLEN_Msk        (0x7UL)   /*!< FSBLEN (Bitfield-Mask: 0x07)                          */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPSW_Pos    (3UL)     /*!< FSBLSKIPSW (Bit 3)                                    */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPSW_Msk    (0x38UL)  /*!< FSBLSKIPSW (Bitfield-Mask: 0x07)                      */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPDS_Pos    (6UL)     /*!< FSBLSKIPDS (Bit 6)                                    */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLSKIPDS_Msk    (0x1c0UL) /*!< FSBLSKIPDS (Bitfield-Mask: 0x07)                      */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLCLK_Pos       (9UL)     /*!< FSBLCLK (Bit 9)                                       */
 #define R_OFS_DATAFLASH_FSBLCTRL0_FSBLCLK_Msk       (0xe00UL) /*!< FSBLCLK (Bitfield-Mask: 0x07)                         */
/* =======================================================  FSBLCTRL1  ======================================================= */
 #define R_OFS_DATAFLASH_FSBLCTRL1_FSBLEXMD_Pos      (0UL)     /*!< FSBLEXMD (Bit 0)                                      */
 #define R_OFS_DATAFLASH_FSBLCTRL1_FSBLEXMD_Msk      (0x3UL)   /*!< FSBLEXMD (Bitfield-Mask: 0x03)                        */
/* =======================================================  FSBLCTRL2  ======================================================= */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTPN_Pos        (0UL)     /*!< PORTPN (Bit 0)                                        */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTPN_Msk        (0xfUL)   /*!< PORTPN (Bitfield-Mask: 0x0f)                          */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTGN_Pos        (4UL)     /*!< PORTGN (Bit 4)                                        */
 #define R_OFS_DATAFLASH_FSBLCTRL2_PORTGN_Msk        (0x1f0UL) /*!< PORTGN (Bitfield-Mask: 0x1f)                          */
/* =========================================================  SACC0  ========================================================= */
/* =========================================================  SACC1  ========================================================= */
/* =========================================================  SAMR  ========================================================== */
/* =======================================================  HOEMRTPK  ======================================================== */
/* =========================================================  ARCLS  ========================================================= */
 #define R_OFS_DATAFLASH_ARCLS_ARCS_LK_Pos          (0UL)          /*!< ARCS_LK (Bit 0)                                       */
 #define R_OFS_DATAFLASH_ARCLS_ARCS_LK_Msk          (0x1UL)        /*!< ARCS_LK (Bitfield-Mask: 0x01)                         */
 #define R_OFS_DATAFLASH_ARCLS_ARCNS_LK_Pos         (1UL)          /*!< ARCNS_LK (Bit 1)                                      */
 #define R_OFS_DATAFLASH_ARCLS_ARCNS_LK_Msk         (0x1eUL)       /*!< ARCNS_LK (Bitfield-Mask: 0x0f)                        */
 #define R_OFS_DATAFLASH_ARCLS_ARCBL_LK_Pos         (5UL)          /*!< ARCBL_LK (Bit 5)                                      */
 #define R_OFS_DATAFLASH_ARCLS_ARCBL_LK_Msk         (0x20UL)       /*!< ARCBL_LK (Bitfield-Mask: 0x01)                        */
/* =========================================================  ARCCS  ========================================================= */
 #define R_OFS_DATAFLASH_ARCCS_CNF_ARCNS_Pos        (0UL)          /*!< CNF_ARCNS (Bit 0)                                     */
 #define R_OFS_DATAFLASH_ARCCS_CNF_ARCNS_Msk        (0x3UL)        /*!< CNF_ARCNS (Bitfield-Mask: 0x03)                       */
/* ========================================================  ARC_SEC  ======================================================== */
 #define R_OFS_DATAFLASH_ARC_SEC_ARC_SEC_Pos        (0UL)          /*!< ARC_SEC (Bit 0)                                       */
 #define R_OFS_DATAFLASH_ARC_SEC_ARC_SEC_Msk        (0xffffffffUL) /*!< ARC_SEC (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  ARC_NSEC  ======================================================== */
 #define R_OFS_DATAFLASH_ARC_NSEC_ARC_NSEC_Pos      (0UL)          /*!< ARC_NSEC (Bit 0)                                      */
 #define R_OFS_DATAFLASH_ARC_NSEC_ARC_NSEC_Msk      (0xffffffffUL) /*!< ARC_NSEC (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  ARC_OEMBL  ======================================================= */
 #define R_OFS_DATAFLASH_ARC_OEMBL_ARC_OEMBL_Pos    (0UL)          /*!< ARC_OEMBL (Bit 0)                                     */
 #define R_OFS_DATAFLASH_ARC_OEMBL_ARC_OEMBL_Msk    (0xffffffffUL) /*!< ARC_OEMBL (Bitfield-Mask: 0xffffffff)                 */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA8E1AF_H */

/** @} */ /* End of group R7FA8E1AF */

/** @} */ /* End of group Renesas */
